state/testdata/dot/job.dot
digraph "job" {
    rankdir=LR;
    node [shape=box, style=rounded];
    __start [shape=point];
    __start -> "Queued";
    "Queued" [style="rounded,filled", fillcolor="#f0d9ff"];
    subgraph cluster_0 {
        label="Running";
        "Running" [style="rounded,filled", fillcolor="#d9f2f2"];
        "Starting";
        "Executing";
    }
    "JobDone" [peripheries=2];
    "Canceled" [peripheries=2];
    "Queued" -> "Running" [label="Enqueue"];
    "Running" -> "Canceled" [label="Cancel"];
    "Executing" -> "JobDone" [label="Finish"];
    "Starting" -> "Executing" [label="Begin"];
}
